# language: ru

Функционал: Создание заявки

  Предыстория:
    #  почта пользователя и пароль берется от пользователя которого мы регистирировали ранее
    Дано я нахожусь на странице "/auth
    И почта пользователя "superman@mail.ru" будет введено в поле с айди "login_email"
    Также пароль пользователя "some_password" будет введено в поле с айди "login_password"
    Когда я нажимаю на кнопку с текстом "Войти"
    Тогда я жду пока пользователь зайдет в сессию

  Сценарий: Успешное создание заявки как клиент
    Когда я нахожусь на странице "/appeals"
    То я нажимаю на кнопку с текстом "Новая заявка"
    Допустим выберу тематику заявки "Бухгалтерия" из списка тематик
    Также введу в поле с айди "add-appeal_title" текст "Заявка от пользователя superman!"
    И выберу приоритет тематики "Критично" из списка приоритетов
    Затем введу в поле с айди "add-appeal_description" текст "Описание проблемы пользователя superman!"
    Когда я нажимаю на кнопку с текстом "Создать заявку"
    То вижу эту свою заявку с заголовком "Заявка от пользователя superman!" в списке заявок на странице "/appeals"
