# language: ru

Функционал: Создание заявки
  Сценарий:
    #  почта пользователя и пароль берется от пользователя которого мы регистирировали ранее
    Дано я нахожусь на странице входа "/auth"
    И почта пользователя "kuat@mail.ru" будет введено в поле с айди "login_email"
    Также пароль пользователя "123456" будет введено в поле с айди "login_password"
    Когда я жму на кнопку с текстом "Войти"
    Тогда я жду пока пользователь зайдет в сессию
    Когда я нахожусь на странице "/appeals"
    То я нажимаю кнопку с текстом "Новая заявка"
    То я нажимаю на селект тематики "add-appeal_topicId"
    Допустим выберу тематику заявки "Отчетность" из списка тематик "div"
    # Допустим выберу тематику заявки "Тех. поддержка" из списка тематик "div"
    То я нажимаю на селект клиента "add-appeal_clientId"
    Допустим выберу клиента заявки "user user" из списка клиентов "div" с классом "ant-select-item-option-content"
    То я нажимаю на селект статуса "add-appeal_status"
    Допустим выберу статус заявки "Выполняется" из списка статусов "div"
    Также введу в поле заголовка "add-appeal_title" текст "Заявка от пользователя user user!"
    То я нажимаю на селект приоритета "add-appeal_priority"
    И выберу приоритет заявки "Критично" из списка приоритетов "div"
    Затем введу в поле с айди "add-appeal_description" текст "Описание проблемы пользователя user user!"
    Когда я нажимаю на кнопку с текстом "Создать заявку"
    То меня переместит на страницу "/appeals"
    То увижу созданную заявку от "user user"