# language: ru
Функционал: Авторизация пользователя

  Сценарий: Успешная авторизация не потвержденного пользователя
    Дано я нахожусь на странице "/auth"
#  почта пользователя и пароль берется от пользователя которого мы регистирировали ранее
    Допустим почта пользователя "superman@mail.ru" будет введено в поле с айди "login_email"
    Также пароль пользователя "some_password" будет введено в поле с айди "login_password"
    Когда я нажимаю на кнопку с текстом "Войти"
    То я вижу текст "Не потвержденный пользователь"