# language: ru

Функционал: Создание тематики
  Сценарий:
    #  почта пользователя и пароль берется от пользователя которого мы регистирировали ранее
    Дано я нахожусь на странице входа "/auth"
    И почта пользователя "superman@mail.ru" будет введено в поле с айди "login_email"
    Также пароль пользователя "some_password" будет введено в поле с айди "login_password"
    Когда я нажимаю на кнопку с текстом "Войти"
    Тогда я жду пока пользователь зайдет в сессию
    То я теперь нахожусь на странице заявок "/appeals"
    То я на ссылку нажму "a" аттрибут "/settings" с текстом "Настройки"
    То я перемещусь на страницу справочники "Справочники:"
    То я жму на кнопку с текстом "Новая тематика"
    То откроется форма создания тематики "Форма"
    Затем в поле тематики с айди "add-appeal_title" введу текст "Тестовая тематика"
    Затем я жму кнопку с текстом "Создать тематику"
    То меня переместит обратно на страницу "/settings/topics"
    То увижу созданную тематику "Тестовая тематика"