# language: ru

Функционал: Создание заявки

  Предыстория:
    #  почта пользователя и пароль берется от пользователя которого мы регистирировали ранее
    Дано я нахожусь на странице входа "/auth"
    И почта пользователя "superman@mail.ru" будет введено в поле с айди "login_email"
    Также пароль пользователя "some_password" будет введено в поле с айди "login_password"
    Когда я нажимаю на кнопку с текстом "Войти"
    Тогда я жду пока пользователь зайдет в сессию

  Сценарий: Успешное создание user-a как клиент
    Когда я нахожусь на странице заявок "/appeals"
    То я нажимаю на ссылку "a" с текстом "Контакты"
    То я перемещусь на страницу контакты "/users"
    То я нажму на кнопку с текстом "Создать пользователя"
    То я нажимаю на селект клиента "add-appeal_clientId"
    Допустим выберу клиента заявки "Пользователь Тестирующий" из списка клиентов "div"
    То я нажимаю на селект статуса "add-appeal_status"
    Допустим выберу статус заявки "Выполняется" из списка статусов "div"
    Также введу в поле заголовка "add-appeal_title" текст "Заявка от пользователя superman!"
    То я нажимаю на селект приоритета "add-appeal_priority"
    И выберу приоритет заявки "Критично" из списка приоритетов "div"
    Затем введу в поле с айди "add-appeal_description" текст "Описание проблемы пользователя superman!"
    Когда я нажимаю на кнопку с текстом "Создать заявку"
    То меня переместит на страницу "/appeals"
    То увижу созданную заявку от "Пользователь Тестирующий"