# language: ru

Функционал: create reglaments
  Сценарий:
    #  почта пользователя и пароль берется от пользователя которого мы регистирировали ранее
    Дано я нахожусь на странице входа "/auth"
    И почта пользователя "superman@mail.ru" будет введено в поле с айди "login_email"
    Также пароль пользователя "some_password" будет введено в поле с айди "login_password"
    Когда я нажимаю на кнопку с текстом "Войти"
    Тогда я жду пока пользователь зайдет в сессию
    То я вижу что нахожусь на странице "/appeals"
    То я нажму  на ссылку "a" аттрибут "/settings" с текстом "Настройки"
    То я теперь на странице справочники "Справочники:"
    Затем я нажму на иконку "svg" аттрибут "menu-fold"
    То я жму селект "setting" выпадающего списка "div"
    Затем я выберу "По регламенту" из выпадающего списка "div"
    Затем я проверю путь "/settings/reglaments"
    Затем я нажму на кнопку "Новый регламент"
    То откроется форма создания регламента "Форма"
    Затем в поле название регламента с айди "add-appeal_title" введу текст "Новый регламент"
    Затем я нажимаю на селект тематики заявки "add-appeal_topicId"
    То выберу тематику заявки "Сайты" из списка тематик "div"
    То я нажимаю на селект компании "add-appeal_companyId"
    То выберу компанию для заявки "Beeline" из списка компании "div"
    То я нажимаю на селект отдела "add-appeal_departmentId"
    То выберу отдел для заявки "Отдел аналитики" из списка отделов "div"
    Затем в поле стандартный срок с айди "add-appeal_standart" введу стандартный срок "48"
    Затем в поле средний срок с айди "add-appeal_middle" введу средний срок "35"
    Затем в поле высокий срок с айди "add-appeal_high" введу высокий срок "24"
    Затем в поле критично срок с айди "add-appeal_incident" введу критично срок "9"
    Затем я нажму кнопку с текстом "Создать регламент"
    То я далее вернусь на "/settings/reglaments"
    То увижу такое сообщение "reglaments создана успешно!"