# language: ru

Функционал: Создание тематики
  Сценарий:
    #  почта пользователя и пароль берется от пользователя которого мы регистирировали ранее
    Дано я нахожусь на странице входа "/auth"
    И почта пользователя "superman@mail.ru" будет введено в поле с айди "login_email"
    Также пароль пользователя "some_password" будет введено в поле с айди "login_password"
    Когда я нажимаю на кнопку с текстом "Войти"
    Тогда я жду пока пользователь зайдет в сессию
    То я теперь нахожусь на странице заявок "/appeals"
    То я на ссылку нажму "a" аттрибут "/settings" с текстом "Настройки"
    То я перемещусь на страницу справочники "Справочники:"
    То я жму на кнопку с текстом "Новая тематика"
    То откроется форма создания тематики "Форма"
    Затем в поле тематики с айди "add-appeal_title" введу текст "Тестовая тематика"
    Затем нажму кнопку с текстом "Создать регламент по тематике"
    Затем я нажимаю на селект отдела "add-appeal_departmentId"
    Затем выберу отдел "Отдел аналитики" из списка "div"
    Затем в поле стандартный срок с айди "add-appeal_standart" введу текст "25"
    Затем в поле средний срок с айди "add-appeal_middle" введу текст "17"
    Затем в поле высокий срок с айди "add-appeal_high" введу текст "9"
    Затем в поле критично срок с айди "add-appeal_incident" введу текст "4"
    Затем я нажму кнопку с текстом "Создать тематику"
    То я буду перемешен на страницу "/settings/topics"
    То я увижу созданную тематику "Тестовая тематика"