# language: ru

Функционал: edit  departments
  Сценарий:
    #  почта пользователя и пароль берется от пользователя которого мы регистирировали ранее
    Дано я нахожусь на странице входа "/auth"
    И почта пользователя "superman@mail.ru" будет введено в поле с айди "login_email"
    Также пароль пользователя "some_password" будет введено в поле с айди "login_password"
    Когда я нажимаю на кнопку с текстом "Войти"
    Тогда я жду пока пользователь зайдет в сессию
    То я вижу что нахожусь на странице "/appeals"
    То я нажму  на ссылку "a" аттрибут "/settings" с текстом "Настройки"
    То я теперь на странице справочники "Справочники:"
    Затем я нажму на иконку "span" аттрибут "menu-fold"
    То я жму селект "setting" выпадающего списка "div"
    Затем я выберу "По компаниям" из выпадающего списка "div"
    Затем я проверю путь "/settings/departments"
    То я жму ссылку "a" аттрибут "Новый отдел" с текстом "Редактировать"
    То откроется форма редактирования отдела "Форма"
    Затем в поле отдела с айди "add-department_title" введу текст "Отдел существующий"
    Затем я жму кнопку с текстом "Обновить"
    То меня переместит на "/settings/departments"
    То увижу отредактированный отдел "Отдел существующий"