# language: ru

Функционал: edit orgstructure
  Сценарий:
    #  почта пользователя и пароль берется от пользователя которого мы регистирировали ранее
    Дано я нахожусь на странице входа "/auth"
    И почта пользователя "superman@mail.ru" будет введено в поле с айди "login_email"
    Также пароль пользователя "some_password" будет введено в поле с айди "login_password"
    Когда я нажимаю на кнопку с текстом "Войти"
    Тогда я жду пока пользователь зайдет в сессию
    То я вижу что нахожусь на странице "/appeals"
    То я нажму  на ссылку "a" аттрибут "/settings" с текстом "Настройки"
    То я теперь на странице справочники "Справочники:"
    Затем я нажму на иконку "svg" аттрибут "menu-fold"
    То я жму селект "setting" выпадающего списка "div"
    Затем я выберу "По орг. структуре" из выпадающего списка "div"
    Затем я проверю путь "/settings/orgstructure"
    То я  жму  ссылку "a" с аттрибутом "Помощник сис. админа" и с текстом "Редактировать"
    То откроется форма редактирования орг структуры "Форма"
    Затем в поле имя должности с айди "orgstructureForm_positionTitle" введу текст "Пом сис. Админа"
    Затем я жму кнопку с текстом "Обновить"
    То я далее вернусь на "/settings/orgstructure"
    То увижу отредактированную должность "Пом сис. Админа"