# language: ru

Функция: Регистрация пользователя
  Сценарий: Успешная регистрация
    Дано я нахожусь на странице "/auth/register"
    Допустим ввожу имя пользователя "Пользователь" в поле с айдишником "register_firstName"
    И ввожу фамилию пользователя "Тестирующий" в поле с айди "register_lastName"
    Допустим почта пользователя "superman@mail.ru" будет введено в поле с айди "register_email"
    Также введу телефон пользователя "+7777333" в поле  с айди "register_phoneNumber"
    Затем нажму селект компании "register_companyId"
    Затем выберу компанию "Beeline KZ1" из списка компаний "div"
    И придумав пароль пользователя к примеру "some_password" введу его в поле с айди "register_password"
    Когда я нажимаю на кнопку с текстом "Зарегистирироваться"
    То я вижу текст "Регистрация прошла успешно! Как только вы будете потверждены администратором, то сможете подавать заявки!" об успешной регистрации!"